In [1]:
import pandas as pd

In [2]:
spott_df = pd.read_csv('spott_df.csv')

In [3]:
spott_df = spott_df.drop(columns='Unnamed: 0')

In [4]:
spott_df.head()

      Cities  Population  Elevation
0      Tokyo   8336599.0       44.0
1    Jakarta   8540121.0       16.0
2  New York    8175133.0       10.0
3      Seoul  10349312.0       38.0
4     Manila   1600000.0       13.0

In [7]:
waqi_df = pd.read_csv('waqi_df.csv')

In [10]:
waqi_df = waqi_df.drop(columns=['Unnamed: 0', 'uvi', 'date'])

In [13]:
waqi_df = waqi_df.rename(columns={'cities': 'Cities', 'aqi': 'AQI','latitude': 'Latitude', 'longitude': 'Longitude', 'pm25': 'PM25', 'pm10': 'PM10', 'o3':'O3'})

In [14]:
waqi_df.head()

      Cities  AQI   Latitude   Longitude  PM25   PM10   O3
0      Tokyo   13  35.641463  139.698171   1.0   21.0  1.0
1    Jakarta  142  -6.182536  106.834236  42.0  173.0  7.0
2  New York   103  40.712784  -74.005941  97.0   27.0  8.0
3      Seoul   38  37.566535  126.977969  74.0   24.0  3.0
4     Manila    -  14.599512  120.984220   NaN    NaN  NaN

In [15]:
combined_df = spott_df.merge(waqi_df, how='inner', on='Cities')

In [16]:
combined_df = combined_df.dropna()

In [17]:
combined_df = combined_df.reset_index().drop(columns='index')

In [18]:
combined_df

,Cities,Population,Elevation,AQI,Latitude,Longitude,PM25,PM10,O3
0,Tokyo,8336599.0,44.0,13,35.641463,139.698171,1.0,21.0,1.0
1,Jakarta,8540121.0,16.0,142,-6.182536,106.834236,42.0,173.0,7.0
2,New York,8175133.0,10.0,103,40.712784,-74.005941,97.0,27.0,8.0
3,Seoul,10349312.0,38.0,38,37.566535,126.977969,74.0,24.0,3.0
4,Mumbai,12691836.0,8.0,160,19.072830,72.882610,167.0,58.0,18.0
...,...,...,...,...,...,...,...,...,...
489,Vientiane,196731.0,174.0,63,17.896122,102.640000,68.0,37.0,17.0
490,Yicheng,176006.0,10.0,93,31.354200,119.817700,112.0,27.0,3.0
491,Skoplje,474889.0,247.0,131,41.992500,21.423611,145.0,48.0,15.0
492,Dali,14760.0,1517.0,34,25.581100,100.217100,42.0,19.0,4.0
493,Rasht,594590.0,4.0,78,37.316581,49.606528,33.0,35.0,4.0